case/DNSCase02/0/U
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}

dimensions      [0 1 -1 0 0 0 0];
internalField   uniform (0 0 0);

boundaryField
{
    bottom
    {
        type    fixedValue;
        value   uniform (0 0.02 0);   // 2 cm/s upward water inflow
    }
    top
    {
        type    pressureInletOutletVelocity;
        value   uniform (0 0 0);
    }
    walls
    {
        type    noSlip;
    }
}
