case/DNSCase02/0/p_rgh
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}

dimensions      [1 -1 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    bottom
    {
        type    fixedFluxPressure;
        value   uniform 0;
    }
    top
    {
        type    totalPressure;
        p0      uniform 0;
    }
    walls
    {
        type    fixedFluxPressure;
        value   uniform 0;
    }
}
