case/DNSCase02/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// We < 1: sigma dominates -> oil droplet stays spherical
// Re based on U=0.02 m/s, L=0.05 m: Re = U*L/nu = 0.02*0.05/1e-6 = 1000

phases (water oil air);

water
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1e-6;
    rho             [1 -3 0 0 0 0 0] 1000;
}

oil
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 5e-5;
    rho             [1 -3 0 0 0 0 0] 850;
}

air
{
    transportModel  Newtonian;
    nu              [0 2 -1 0 0 0 0] 1.48e-5;
    rho             [1 -3 0 0 0 0 0] 1.2;
}

sigma12     [1 0 -2 0 0 0 0] 0.07;    // water-oil
sigma13     [1 0 -2 0 0 0 0] 0.072;   // water-air
sigma23     [1 0 -2 0 0 0 0] 0.035;   // oil-air
D23         [0 2 -1 0 0 0 0] 1e-9;
