case/DNSCase02/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

// Domain starts full of water with a central oil droplet
defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue alpha.oil   0
    volScalarFieldValue alpha.air   0
    volScalarFieldValue alpha       0
);

regions
(
    sphereToCell
    {
        centre  (0.025 0.05 0.025);
        radius  0.008;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.oil   1
            volScalarFieldValue alpha.air   0
            volScalarFieldValue alpha       1
        );
    }
);
